#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # docker_container.db will be created
  + resource "docker_container" "db" {
      + attach                                      = false
      + bridge                                      = (known after apply)
      + command                                     = (known after apply)
      + container_logs                              = (known after apply)
      + container_read_refresh_timeout_milliseconds = 15000
      + entrypoint                                  = (known after apply)
      + env                                         = (sensitive value)
      + exit_code                                   = (known after apply)
      + hostname                                    = (known after apply)
      + id                                          = (known after apply)
      + image                                       = (known after apply)
      + init                                        = (known after apply)
      + ipc_mode                                    = (known after apply)
      + log_driver                                  = (known after apply)
      + logs                                        = false
      + must_run                                    = true
      + name                                        = "db"
      + network_data                                = (known after apply)
      + read_only                                   = false
      + remove_volumes                              = true
      + restart                                     = "no"
      + rm                                          = false
      + runtime                                     = (known after apply)
      + security_opts                               = (known after apply)
      + shm_size                                    = (known after apply)
      + start                                       = true
      + stdin_open                                  = false
      + stop_signal                                 = (known after apply)
      + stop_timeout                                = (known after apply)
      + tty                                         = false
      + wait                                        = false
      + wait_timeout                                = 60

      + healthcheck {
          + interval     = "5s"
          + retries      = 0
          + start_period = "0s"
          + test         = [
              + "CMD",
              + "sh",
              + "/healthchecks/postgres.sh",
            ]
          + timeout      = "0s"
        }

      + networks_advanced {
          + aliases = []
          + name    = "back-tier"
        }

      + volumes {
          + container_path = "/healthchecks"
          + host_path      = "/home/runner/work/terraform-vote-app-deployment/terraform-vote-app-deployment/terraform/part1-docker/../../healthchecks"
        }
      + volumes {
          + container_path = "/var/lib/postgresql/data"
          + volume_name    = "db-data"
        }
    }

  # docker_container.nginx will be created
  + resource "docker_container" "nginx" {
      + attach                                      = false
      + bridge                                      = (known after apply)
      + command                                     = (known after apply)
      + container_logs                              = (known after apply)
      + container_read_refresh_timeout_milliseconds = 15000
      + entrypoint                                  = (known after apply)
      + env                                         = (known after apply)
      + exit_code                                   = (known after apply)
      + hostname                                    = (known after apply)
      + id                                          = (known after apply)
      + image                                       = (known after apply)
      + init                                        = (known after apply)
      + ipc_mode                                    = (known after apply)
      + log_driver                                  = (known after apply)
      + logs                                        = false
      + must_run                                    = true
      + name                                        = "nginx"
      + network_data                                = (known after apply)
      + read_only                                   = false
      + remove_volumes                              = true
      + restart                                     = "no"
      + rm                                          = false
      + runtime                                     = (known after apply)
      + security_opts                               = (known after apply)
      + shm_size                                    = (known after apply)
      + start                                       = true
      + stdin_open                                  = false
      + stop_signal                                 = (known after apply)
      + stop_timeout                                = (known after apply)
      + tty                                         = false
      + wait                                        = false
      + wait_timeout                                = 60

      + networks_advanced {
          + aliases = []
          + name    = "front-tier"
        }

      + ports {
          + external = 8000
          + internal = 8000
          + ip       = "0.0.0.0"
          + protocol = "tcp"
        }
    }

  # docker_container.redis will be created
  + resource "docker_container" "redis" {
      + attach                                      = false
      + bridge                                      = (known after apply)
      + command                                     = (known after apply)
      + container_logs                              = (known after apply)
      + container_read_refresh_timeout_milliseconds = 15000
      + entrypoint                                  = (known after apply)
      + env                                         = (known after apply)
      + exit_code                                   = (known after apply)
      + hostname                                    = (known after apply)
      + id                                          = (known after apply)
      + image                                       = (known after apply)
      + init                                        = (known after apply)
      + ipc_mode                                    = (known after apply)
      + log_driver                                  = (known after apply)
      + logs                                        = false
      + must_run                                    = true
      + name                                        = "redis"
      + network_data                                = (known after apply)
      + read_only                                   = false
      + remove_volumes                              = true
      + restart                                     = "no"
      + rm                                          = false
      + runtime                                     = (known after apply)
      + security_opts                               = (known after apply)
      + shm_size                                    = (known after apply)
      + start                                       = true
      + stdin_open                                  = false
      + stop_signal                                 = (known after apply)
      + stop_timeout                                = (known after apply)
      + tty                                         = false
      + wait                                        = false
      + wait_timeout                                = 60

      + healthcheck {
          + interval     = "5s"
          + retries      = 0
          + start_period = "0s"
          + test         = [
              + "CMD",
              + "sh",
              + "/healthchecks/redis.sh",
            ]
          + timeout      = "0s"
        }

      + networks_advanced {
          + aliases = []
          + name    = "back-tier"
        }

      + volumes {
          + container_path = "/healthchecks"
          + host_path      = "/home/runner/work/terraform-vote-app-deployment/terraform-vote-app-deployment/terraform/part1-docker/../../healthchecks"
        }
    }

  # docker_container.result will be created
  + resource "docker_container" "result" {
      + attach                                      = false
      + bridge                                      = (known after apply)
      + command                                     = (known after apply)
      + container_logs                              = (known after apply)
      + container_read_refresh_timeout_milliseconds = 15000
      + entrypoint                                  = (known after apply)
      + env                                         = (known after apply)
      + exit_code                                   = (known after apply)
      + hostname                                    = (known after apply)
      + id                                          = (known after apply)
      + image                                       = (known after apply)
      + init                                        = (known after apply)
      + ipc_mode                                    = (known after apply)
      + log_driver                                  = (known after apply)
      + logs                                        = false
      + must_run                                    = true
      + name                                        = "result"
      + network_data                                = (known after apply)
      + read_only                                   = false
      + remove_volumes                              = true
      + restart                                     = "no"
      + rm                                          = false
      + runtime                                     = (known after apply)
      + security_opts                               = (known after apply)
      + shm_size                                    = (known after apply)
      + start                                       = true
      + stdin_open                                  = false
      + stop_signal                                 = (known after apply)
      + stop_timeout                                = (known after apply)
      + tty                                         = false
      + wait                                        = false
      + wait_timeout                                = 60

      + networks_advanced {
          + aliases = []
          + name    = "back-tier"
        }
      + networks_advanced {
          + aliases = []
          + name    = "front-tier"
        }

      + ports {
          + external = 5050
          + internal = 80
          + ip       = "0.0.0.0"
          + protocol = "tcp"
        }
    }

  # docker_container.seed will be created
  + resource "docker_container" "seed" {
      + attach                                      = false
      + bridge                                      = (known after apply)
      + command                                     = (known after apply)
      + container_logs                              = (known after apply)
      + container_read_refresh_timeout_milliseconds = 15000
      + entrypoint                                  = (known after apply)
      + env                                         = [
          + "TARGET_HOST=nginx",
          + "TARGET_PORT=8000",
        ]
      + exit_code                                   = (known after apply)
      + hostname                                    = (known after apply)
      + id                                          = (known after apply)
      + image                                       = (known after apply)
      + init                                        = (known after apply)
      + ipc_mode                                    = (known after apply)
      + log_driver                                  = (known after apply)
      + logs                                        = false
      + must_run                                    = true
      + name                                        = "seed"
      + network_data                                = (known after apply)
      + read_only                                   = false
      + remove_volumes                              = true
      + restart                                     = "no"
      + rm                                          = false
      + runtime                                     = (known after apply)
      + security_opts                               = (known after apply)
      + shm_size                                    = (known after apply)
      + start                                       = true
      + stdin_open                                  = false
      + stop_signal                                 = (known after apply)
      + stop_timeout                                = (known after apply)
      + tty                                         = false
      + wait                                        = false
      + wait_timeout                                = 60

      + networks_advanced {
          + aliases = []
          + name    = "front-tier"
        }
    }

  # docker_container.vote[0] will be created
  + resource "docker_container" "vote" {
      + attach                                      = false
      + bridge                                      = (known after apply)
      + command                                     = (known after apply)
      + container_logs                              = (known after apply)
      + container_read_refresh_timeout_milliseconds = 15000
      + entrypoint                                  = (known after apply)
      + env                                         = (known after apply)
      + exit_code                                   = (known after apply)
      + hostname                                    = (known after apply)
      + id                                          = (known after apply)
      + image                                       = (known after apply)
      + init                                        = (known after apply)
      + ipc_mode                                    = (known after apply)
      + log_driver                                  = (known after apply)
      + logs                                        = false
      + must_run                                    = true
      + name                                        = "vote1"
      + network_data                                = (known after apply)
      + read_only                                   = false
      + remove_volumes                              = true
      + restart                                     = "no"
      + rm                                          = false
      + runtime                                     = (known after apply)
      + security_opts                               = (known after apply)
      + shm_size                                    = (known after apply)
      + start                                       = true
      + stdin_open                                  = false
      + stop_signal                                 = (known after apply)
      + stop_timeout                                = (known after apply)
      + tty                                         = false
      + wait                                        = false
      + wait_timeout                                = 60

      + healthcheck {
          + interval     = "15s"
          + retries      = 2
          + start_period = "5s"
          + test         = [
              + "CMD",
              + "curl",
              + "-f",
              + "http://localhost:5000",
            ]
          + timeout      = "5s"
        }

      + networks_advanced {
          + aliases = []
          + name    = "back-tier"
        }
      + networks_advanced {
          + aliases = []
          + name    = "front-tier"
        }
    }

  # docker_container.vote[1] will be created
  + resource "docker_container" "vote" {
      + attach                                      = false
      + bridge                                      = (known after apply)
      + command                                     = (known after apply)
      + container_logs                              = (known after apply)
      + container_read_refresh_timeout_milliseconds = 15000
      + entrypoint                                  = (known after apply)
      + env                                         = (known after apply)
      + exit_code                                   = (known after apply)
      + hostname                                    = (known after apply)
      + id                                          = (known after apply)
      + image                                       = (known after apply)
      + init                                        = (known after apply)
      + ipc_mode                                    = (known after apply)
      + log_driver                                  = (known after apply)
      + logs                                        = false
      + must_run                                    = true
      + name                                        = "vote2"
      + network_data                                = (known after apply)
      + read_only                                   = false
      + remove_volumes                              = true
      + restart                                     = "no"
      + rm                                          = false
      + runtime                                     = (known after apply)
      + security_opts                               = (known after apply)
      + shm_size                                    = (known after apply)
      + start                                       = true
      + stdin_open                                  = false
      + stop_signal                                 = (known after apply)
      + stop_timeout                                = (known after apply)
      + tty                                         = false
      + wait                                        = false
      + wait_timeout                                = 60

      + healthcheck {
          + interval     = "15s"
          + retries      = 2
          + start_period = "5s"
          + test         = [
              + "CMD",
              + "curl",
              + "-f",
              + "http://localhost:5000",
            ]
          + timeout      = "5s"
        }

      + networks_advanced {
          + aliases = []
          + name    = "back-tier"
        }
      + networks_advanced {
          + aliases = []
          + name    = "front-tier"
        }
    }

  # docker_container.worker will be created
  + resource "docker_container" "worker" {
      + attach                                      = false
      + bridge                                      = (known after apply)
      + command                                     = (known after apply)
      + container_logs                              = (known after apply)
      + container_read_refresh_timeout_milliseconds = 15000
      + entrypoint                                  = (known after apply)
      + env                                         = (known after apply)
      + exit_code                                   = (known after apply)
      + hostname                                    = (known after apply)
      + id                                          = (known after apply)
      + image                                       = (known after apply)
      + init                                        = (known after apply)
      + ipc_mode                                    = (known after apply)
      + log_driver                                  = (known after apply)
      + logs                                        = false
      + must_run                                    = true
      + name                                        = "worker"
      + network_data                                = (known after apply)
      + read_only                                   = false
      + remove_volumes                              = true
      + restart                                     = "no"
      + rm                                          = false
      + runtime                                     = (known after apply)
      + security_opts                               = (known after apply)
      + shm_size                                    = (known after apply)
      + start                                       = true
      + stdin_open                                  = false
      + stop_signal                                 = (known after apply)
      + stop_timeout                                = (known after apply)
      + tty                                         = false
      + wait                                        = false
      + wait_timeout                                = 60

      + networks_advanced {
          + aliases = []
          + name    = "back-tier"
        }
    }

  # docker_image.nginx will be created
  + resource "docker_image" "nginx" {
      + force_remove = true
      + id           = (known after apply)
      + image_id     = (known after apply)
      + name         = "nginx-vote:latest"
      + repo_digest  = (known after apply)

      + build {
          + cache_from   = []
          + context      = "/home/runner/work/terraform-vote-app-deployment/terraform-vote-app-deployment/terraform/part1-docker/../../voting-services/nginx"
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + no_cache     = false
          + remove       = true
          + security_opt = []
          + tag          = []
        }
    }

  # docker_image.postgres will be created
  + resource "docker_image" "postgres" {
      + force_remove = true
      + id           = (known after apply)
      + image_id     = (known after apply)
      + name         = "postgres:15-alpine"
      + repo_digest  = (known after apply)
    }

  # docker_image.redis will be created
  + resource "docker_image" "redis" {
      + force_remove = true
      + id           = (known after apply)
      + image_id     = (known after apply)
      + name         = "redis:alpine"
      + repo_digest  = (known after apply)
    }

  # docker_image.result will be created
  + resource "docker_image" "result" {
      + force_remove = true
      + id           = (known after apply)
      + image_id     = (known after apply)
      + name         = "result:latest"
      + repo_digest  = (known after apply)

      + build {
          + cache_from   = []
          + context      = "/home/runner/work/terraform-vote-app-deployment/terraform-vote-app-deployment/terraform/part1-docker/../../voting-services/result"
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + no_cache     = false
          + remove       = true
          + security_opt = []
          + tag          = []
        }
    }

  # docker_image.seed will be created
  + resource "docker_image" "seed" {
      + force_remove = true
      + id           = (known after apply)
      + image_id     = (known after apply)
      + name         = "seed:latest"
      + repo_digest  = (known after apply)

      + build {
          + cache_from   = []
          + context      = "/home/runner/work/terraform-vote-app-deployment/terraform-vote-app-deployment/terraform/part1-docker/../../voting-services/seed-data"
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + no_cache     = false
          + remove       = true
          + security_opt = []
          + tag          = []
        }
    }

  # docker_image.vote will be created
  + resource "docker_image" "vote" {
      + force_remove = true
      + id           = (known after apply)
      + image_id     = (known after apply)
      + name         = "vote:latest"
      + repo_digest  = (known after apply)

      + build {
          + cache_from   = []
          + context      = "/home/runner/work/terraform-vote-app-deployment/terraform-vote-app-deployment/terraform/part1-docker/../../voting-services/vote"
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + no_cache     = false
          + remove       = true
          + security_opt = []
          + tag          = []
        }
    }

  # docker_image.worker will be created
  + resource "docker_image" "worker" {
      + force_remove = true
      + id           = (known after apply)
      + image_id     = (known after apply)
      + name         = "worker:latest"
      + repo_digest  = (known after apply)

      + build {
          + cache_from   = []
          + context      = "/home/runner/work/terraform-vote-app-deployment/terraform-vote-app-deployment/terraform/part1-docker/../../voting-services/worker"
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + no_cache     = false
          + remove       = true
          + security_opt = []
          + tag          = []
        }
    }

  # docker_network.back_tier will be created
  + resource "docker_network" "back_tier" {
      + driver      = (known after apply)
      + id          = (known after apply)
      + internal    = (known after apply)
      + ipam_driver = "default"
      + name        = "back-tier"
      + options     = (known after apply)
      + scope       = (known after apply)
    }

  # docker_network.front_tier will be created
  + resource "docker_network" "front_tier" {
      + driver      = (known after apply)
      + id          = (known after apply)
      + internal    = (known after apply)
      + ipam_driver = "default"
      + name        = "front-tier"
      + options     = (known after apply)
      + scope       = (known after apply)
    }

  # docker_volume.db_data will be created
  + resource "docker_volume" "db_data" {
      + driver     = (known after apply)
      + id         = (known after apply)
      + mountpoint = (known after apply)
      + name       = "db-data"
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + result_url = "http://localhost:5050"
  + vote_url   = "http://localhost:8000"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @soufiane-ezzemany, Action: `pull_request`, Working Directory: `terraform/part1-docker`, Workflow: `Terraform CI`*